app/views/chats/_navside.html.erb

SELECT "chats".* FROM "chats" INNER JOIN "chats_users" ON "chats"."id" = "chats_users"."chat_id" WHERE "chats_users"."user_id" = ?  [["user_id", 9]]
---
        <ul class="list-group">
          <% current_user.chats.each do |chatroom| %>