app/controllers/chats_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def add_user
    params[:users].each do |id|
      @chat.users<<User.find_by_id(id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def delete_user
    user=User.find_by_id(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "chats".* FROM "chats" INNER JOIN "chats_users" ON "chats"."id" = "chats_users"."chat_id" WHERE "chats_users"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "chats_users" ON "users"."id" = "chats_users"."user_id" WHERE "chats_users"."chat_id" = ?  [["chat_id", 1]]
INSERT INTO "chats" ("admin_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["admin_id", 1], ["name", "user3-user1"], ["created_at", "2018-11-24 05:18:58.463408"], ["updated_at", "2018-11-24 05:18:58.463408"]]
---
  def create
    user=User.find_by_id(params[:users])

    current_user.chats.each do |chat|
      if (chat.users-[user, current_user]).blank?
        redirect_to chat_path(chat) and return
      end
    end

    @chat = Chat.new
    @chat.users<<user

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 9]]
INSERT INTO "chats_users" ("chat_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["chat_id", 4], ["user_id", 101], ["created_at", "2018-12-10 14:09:45.803971"], ["updated_at", "2018-12-10 14:09:45.803971"]]
UPDATE "chats" SET "admin_id" = ?, "updated_at" = ? WHERE "chats"."id" = ?  [["admin_id", 1], ["updated_at", "2018-12-10 13:16:50.973593"], ["id", 3]]
---
  def set_priority
    chats_users=ChatsUser.where(user_id: params[:user_id], chat_id: @chat.id).limit(1)
    if !chats_users.nil?
      chat_user=chats_users.first
      if !chat_user.nil?
        if params[:priority]=="up"
          chat_user[:priority]=2
        elsif params[:priority]=="reset"
          chat_user[:priority]=1
        else
          chat_user[:priority]=0
        end

        if chat_user.save

DELETE FROM "chats" WHERE "chats"."id" = ?  [["id", 5]]
---
  def destroy
    @chat.destroy

SELECT "users".* FROM "users" INNER JOIN "friendships" ON "users"."id" = "friendships"."user_id" WHERE "friendships"."friend_id" = ?  [["friend_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."role" = ? LIMIT 1  [["role", 100]]
SELECT  1 AS one FROM "users" INNER JOIN "chats_users" ON "users"."id" = "chats_users"."user_id" WHERE "chats_users"."chat_id" = ? AND "users"."id" = ? LIMIT 1  [["chat_id", 1], ["id", 1]]
SELECT  "robots".* FROM "robots" WHERE "robots"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @new_message = Message.new
    @users_in_chat= @chat.users-[current_user]
    @friends=current_user.friends & current_user.inverse_friends
    @new_friends=current_user.inverse_friends - current_user.friends
    @applications=current_user.friends - current_user.inverse_friends
    @friends_out_chat=@friends-@chat.users
    @chats_users=ChatsUser.where(user_id:current_user.id).order(priority: :desc)

    read_flags=ReadFlag.joins(:message).where(user_id:current_user.id, flag:false, messages: {chat_id: params[:id]})
    for flag in read_flags
      flag.update(flag: true)
    end

    robot=User.find_by(role: 100)
    @has_robot=@chat.users.include?(robot)
    if @has_robot
      @robot_attr=Robot.find_by_id(1);

SELECT  "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT 1  [["id", 5]]
---
  def set_chat
    @chat=Chat.find_by_id(params[:id])