app/controllers/friendships_controller.rb

  def create
    new_friend_id = params[:friend_id]
    if !new_friend_id.nil?
      @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
    else
      user=User.find_by_id(params[:id])
      application=user.friendships.find_by(friend_id: current_user[:id])
      if !application.nil?
        @friendship = current_user.friendships.build(:friend_id => params[:id])
      end
    end
    if !@friendship.nil? and @friendship.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = ? LIMIT 1  [["user_id", 1], ["friend_id", 9]]
INSERT INTO "friendships" ("friend_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["friend_id", 6], ["user_id", 1], ["created_at", "2018-11-24 05:21:31.323981"], ["updated_at", "2018-11-24 05:21:31.323981"]]

  def destroy
    @friendship = current_user.friendships.find_by(friend_id: params[:id])
    if !@friendship.nil?
      @friendship.destroy
    end

    user=User.find_by_id(params[:id])
    current_user.chats.each do |chat|
      if (chat.users-[user, current_user]).blank?
        chat.destroy
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = ? LIMIT 1  [["user_id", 1], ["friend_id", 2]]
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "chats".* FROM "chats" INNER JOIN "chats_users" ON "chats"."id" = "chats_users"."chat_id" WHERE "chats_users"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "chats_users" ON "users"."id" = "chats_users"."user_id" WHERE "chats_users"."chat_id" = ?  [["chat_id", 1]]
DELETE FROM "chats" WHERE "chats"."id" = ?  [["id", 1]]