app/controllers/messages_controller.rb

  def create
    @message = current_user.messages.build(message_params)
    chat=Chat.find_by_id(params[:chat_room])
    redirect_to chats_path, flash: {:warning => '此聊天不存在'} and return if chat.nil?
    @message.chat=chat

    if @message.save
      sync_new @message, scope: chat
      robot=User.find_by(role: 100)
      if chat.users.include?(robot)
---
SELECT  "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "messages" ("body", "user_id", "chat_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "hi"], ["user_id", 3], ["chat_id", 1], ["created_at", "2018-11-26 10:01:24.090428"], ["updated_at", "2018-11-26 10:01:24.090428"]]
SELECT  "users".* FROM "users" WHERE "users"."role" = ? LIMIT 1  [["role", 100]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT  1 AS one FROM "users" INNER JOIN "chats_users" ON "users"."id" = "chats_users"."user_id" WHERE "chats_users"."chat_id" = ? AND "users"."id" = ? LIMIT 1  [["chat_id", 4], ["id", 101]]

          robot_message=robot.messages.build({"body" => text})
          robot_message.chat=chat
          if robot_message.save
            robot_attr=Robot.find_by_id(1);
---
SELECT  "robots".* FROM "robots" WHERE "robots"."id" = ? LIMIT 1  [["id", 1]]

            if code != 5000
              robot_attr[:solve_times] += 1
            end
            if robot_attr.save
---
UPDATE "robots" SET "response_times" = ?, "total_time" = ?, "solve_times" = ?, "updated_at" = ? WHERE "robots"."id" = ?  [["response_times", 2], ["total_time", 0.288237786], ["solve_times", 1], ["updated_at", "2018-12-10 16:51:39.514103"], ["id", 1]]

  def destroy
    @message = Message.find(params[:id])
    chat=Chat.find_by_id(params[:chat_room])
    @message.destroy
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 980190962]]
SELECT  "chats".* FROM "chats" WHERE "chats"."id" IS NULL LIMIT 1
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 980190962]]

  def destroyall
    chat=Chat.find_by_id(params[:chat_room])
---
SELECT  "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT 1  [["id", 8]]