app/controllers/users_controller.rb

  def create
    @user=User.new(user_params)
    @user.phonenumber=""
    @user.role=1
    @user.sex="male"
    @user.status="user"
    if @user.save
---
INSERT INTO "users" ("name", "email", "sex", "password_digest", "phonenumber", "role", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "test1@test.com"], ["password_digest", "$2a$10$Mg5JOm1bs1heDCIoWd82QegnaTqDVHn2UvEczuhUDqbgsa7g9/2h6"], ["updated_at", "2018-11-23 11:06:38.057974"], ["id", 2]]